/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Default)]
pub(crate) struct __IncompleteArrayField<T>(::core::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub(crate) const fn new() -> Self {
        __IncompleteArrayField(::core::marker::PhantomData, [])
    }
    #[inline]
    pub(crate) fn as_ptr(&self) -> *const T {
        self as *const _ as *const T
    }
    #[inline]
    pub(crate) fn as_mut_ptr(&mut self) -> *mut T {
        self as *mut _ as *mut T
    }
    #[inline]
    pub(crate) unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::core::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub(crate) unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::core::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::core::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
pub(crate) type __mode_t = ::core::ffi::c_uint;
pub(crate) type __socklen_t = ::core::ffi::c_uint;
pub(crate) type mode_t = __mode_t;
pub(crate) type socklen_t = __socklen_t;
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub(crate) struct sockaddr {
    pub(crate) _bindgen_opaque_blob: [u16; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sockaddr"][::core::mem::size_of::<sockaddr>() - 16usize];
    ["Alignment of sockaddr"][::core::mem::align_of::<sockaddr>() - 2usize];
};
pub(crate) type __kernel_time64_t = ::core::ffi::c_longlong;
pub(crate) type __u8 = ::core::ffi::c_uchar;
pub(crate) type __u16 = ::core::ffi::c_ushort;
pub(crate) type __s32 = ::core::ffi::c_int;
pub(crate) type __u32 = ::core::ffi::c_uint;
pub(crate) type __u64 = ::core::ffi::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub(crate) struct __kernel_timespec {
    pub(crate) tv_sec: __kernel_time64_t,
    pub(crate) tv_nsec: ::core::ffi::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __kernel_timespec"][::core::mem::size_of::<__kernel_timespec>() - 16usize];
    ["Alignment of __kernel_timespec"][::core::mem::align_of::<__kernel_timespec>() - 8usize];
    ["Offset of field: __kernel_timespec::tv_sec"]
        [::core::mem::offset_of!(__kernel_timespec, tv_sec) - 0usize];
    ["Offset of field: __kernel_timespec::tv_nsec"]
        [::core::mem::offset_of!(__kernel_timespec, tv_nsec) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub(crate) struct io_uring_sqe {
    pub(crate) opcode: __u8,
    pub(crate) flags: __u8,
    pub(crate) ioprio: __u16,
    pub(crate) fd: __s32,
    pub(crate) __bindgen_anon_1: io_uring_sqe__bindgen_ty_1,
    pub(crate) __bindgen_anon_2: io_uring_sqe__bindgen_ty_2,
    pub(crate) len: __u32,
    pub(crate) __bindgen_anon_3: io_uring_sqe__bindgen_ty_3,
    pub(crate) user_data: __u64,
    pub(crate) __bindgen_anon_4: io_uring_sqe__bindgen_ty_4,
    pub(crate) personality: __u16,
    pub(crate) __bindgen_anon_5: io_uring_sqe__bindgen_ty_5,
    pub(crate) __bindgen_anon_6: io_uring_sqe__bindgen_ty_6,
}
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub(crate) union io_uring_sqe__bindgen_ty_1 {
    pub(crate) _bindgen_opaque_blob: u64,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub(crate) struct io_uring_sqe__bindgen_ty_1__bindgen_ty_1 {
    pub(crate) _bindgen_opaque_blob: [u32; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<io_uring_sqe__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of io_uring_sqe__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<io_uring_sqe__bindgen_ty_1__bindgen_ty_1>() - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_1"]
        [::core::mem::size_of::<io_uring_sqe__bindgen_ty_1>() - 8usize];
    ["Alignment of io_uring_sqe__bindgen_ty_1"]
        [::core::mem::align_of::<io_uring_sqe__bindgen_ty_1>() - 8usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub(crate) union io_uring_sqe__bindgen_ty_2 {
    pub(crate) _bindgen_opaque_blob: u64,
}
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub(crate) struct io_uring_sqe__bindgen_ty_2__bindgen_ty_1 {
    pub(crate) _bindgen_opaque_blob: [u32; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_2__bindgen_ty_1"]
        [::core::mem::size_of::<io_uring_sqe__bindgen_ty_2__bindgen_ty_1>() - 8usize];
    ["Alignment of io_uring_sqe__bindgen_ty_2__bindgen_ty_1"]
        [::core::mem::align_of::<io_uring_sqe__bindgen_ty_2__bindgen_ty_1>() - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_2"]
        [::core::mem::size_of::<io_uring_sqe__bindgen_ty_2>() - 8usize];
    ["Alignment of io_uring_sqe__bindgen_ty_2"]
        [::core::mem::align_of::<io_uring_sqe__bindgen_ty_2>() - 8usize];
};
#[repr(C)]
#[repr(align(4))]
#[derive(Copy, Clone)]
pub(crate) union io_uring_sqe__bindgen_ty_3 {
    pub(crate) _bindgen_opaque_blob: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_3"]
        [::core::mem::size_of::<io_uring_sqe__bindgen_ty_3>() - 4usize];
    ["Alignment of io_uring_sqe__bindgen_ty_3"]
        [::core::mem::align_of::<io_uring_sqe__bindgen_ty_3>() - 4usize];
};
#[repr(C)]
#[repr(align(1))]
#[derive(Copy, Clone)]
pub(crate) union io_uring_sqe__bindgen_ty_4 {
    pub(crate) _bindgen_opaque_blob: [u8; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_4"]
        [::core::mem::size_of::<io_uring_sqe__bindgen_ty_4>() - 2usize];
    ["Alignment of io_uring_sqe__bindgen_ty_4"]
        [::core::mem::align_of::<io_uring_sqe__bindgen_ty_4>() - 1usize];
};
#[repr(C)]
#[repr(align(4))]
#[derive(Copy, Clone)]
pub(crate) union io_uring_sqe__bindgen_ty_5 {
    pub(crate) _bindgen_opaque_blob: u32,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub(crate) struct io_uring_sqe__bindgen_ty_5__bindgen_ty_1 {
    pub(crate) _bindgen_opaque_blob: [u16; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_5__bindgen_ty_1"]
        [::core::mem::size_of::<io_uring_sqe__bindgen_ty_5__bindgen_ty_1>() - 4usize];
    ["Alignment of io_uring_sqe__bindgen_ty_5__bindgen_ty_1"]
        [::core::mem::align_of::<io_uring_sqe__bindgen_ty_5__bindgen_ty_1>() - 2usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_5"]
        [::core::mem::size_of::<io_uring_sqe__bindgen_ty_5>() - 4usize];
    ["Alignment of io_uring_sqe__bindgen_ty_5"]
        [::core::mem::align_of::<io_uring_sqe__bindgen_ty_5>() - 4usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Copy, Clone)]
pub(crate) union io_uring_sqe__bindgen_ty_6 {
    pub(crate) _bindgen_opaque_blob: [u64; 2usize],
}
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub(crate) struct io_uring_sqe__bindgen_ty_6__bindgen_ty_1 {
    pub(crate) _bindgen_opaque_blob: [u64; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_6__bindgen_ty_1"]
        [::core::mem::size_of::<io_uring_sqe__bindgen_ty_6__bindgen_ty_1>() - 16usize];
    ["Alignment of io_uring_sqe__bindgen_ty_6__bindgen_ty_1"]
        [::core::mem::align_of::<io_uring_sqe__bindgen_ty_6__bindgen_ty_1>() - 8usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub(crate) struct io_uring_sqe__bindgen_ty_6__bindgen_ty_2 {
    pub(crate) _bindgen_opaque_blob: [u64; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_6__bindgen_ty_2"]
        [::core::mem::size_of::<io_uring_sqe__bindgen_ty_6__bindgen_ty_2>() - 16usize];
    ["Alignment of io_uring_sqe__bindgen_ty_6__bindgen_ty_2"]
        [::core::mem::align_of::<io_uring_sqe__bindgen_ty_6__bindgen_ty_2>() - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe__bindgen_ty_6"]
        [::core::mem::size_of::<io_uring_sqe__bindgen_ty_6>() - 16usize];
    ["Alignment of io_uring_sqe__bindgen_ty_6"]
        [::core::mem::align_of::<io_uring_sqe__bindgen_ty_6>() - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sqe"][::core::mem::size_of::<io_uring_sqe>() - 64usize];
    ["Alignment of io_uring_sqe"][::core::mem::align_of::<io_uring_sqe>() - 8usize];
    ["Offset of field: io_uring_sqe::opcode"]
        [::core::mem::offset_of!(io_uring_sqe, opcode) - 0usize];
    ["Offset of field: io_uring_sqe::flags"][::core::mem::offset_of!(io_uring_sqe, flags) - 1usize];
    ["Offset of field: io_uring_sqe::ioprio"]
        [::core::mem::offset_of!(io_uring_sqe, ioprio) - 2usize];
    ["Offset of field: io_uring_sqe::fd"][::core::mem::offset_of!(io_uring_sqe, fd) - 4usize];
    ["Offset of field: io_uring_sqe::len"][::core::mem::offset_of!(io_uring_sqe, len) - 24usize];
    ["Offset of field: io_uring_sqe::user_data"]
        [::core::mem::offset_of!(io_uring_sqe, user_data) - 32usize];
    ["Offset of field: io_uring_sqe::personality"]
        [::core::mem::offset_of!(io_uring_sqe, personality) - 42usize];
};
#[repr(C)]
#[derive(Debug)]
pub(crate) struct io_uring_cqe {
    pub(crate) user_data: __u64,
    pub(crate) res: __s32,
    pub(crate) flags: __u32,
    pub(crate) big_cqe: __IncompleteArrayField<__u64>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_cqe"][::core::mem::size_of::<io_uring_cqe>() - 16usize];
    ["Alignment of io_uring_cqe"][::core::mem::align_of::<io_uring_cqe>() - 8usize];
    ["Offset of field: io_uring_cqe::user_data"]
        [::core::mem::offset_of!(io_uring_cqe, user_data) - 0usize];
    ["Offset of field: io_uring_cqe::res"][::core::mem::offset_of!(io_uring_cqe, res) - 8usize];
    ["Offset of field: io_uring_cqe::flags"]
        [::core::mem::offset_of!(io_uring_cqe, flags) - 12usize];
    ["Offset of field: io_uring_cqe::big_cqe"]
        [::core::mem::offset_of!(io_uring_cqe, big_cqe) - 16usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub(crate) struct io_uring_sq {
    pub(crate) _bindgen_opaque_blob: [u64; 13usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_sq"][::core::mem::size_of::<io_uring_sq>() - 104usize];
    ["Alignment of io_uring_sq"][::core::mem::align_of::<io_uring_sq>() - 8usize];
};
#[repr(C)]
#[repr(align(8))]
#[derive(Debug, Copy, Clone)]
pub(crate) struct io_uring_cq {
    pub(crate) _bindgen_opaque_blob: [u64; 11usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring_cq"][::core::mem::size_of::<io_uring_cq>() - 88usize];
    ["Alignment of io_uring_cq"][::core::mem::align_of::<io_uring_cq>() - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub(crate) struct io_uring {
    pub(crate) sq: io_uring_sq,
    pub(crate) cq: io_uring_cq,
    pub(crate) flags: ::core::ffi::c_uint,
    pub(crate) ring_fd: ::core::ffi::c_int,
    pub(crate) features: ::core::ffi::c_uint,
    pub(crate) enter_ring_fd: ::core::ffi::c_int,
    pub(crate) int_flags: __u8,
    pub(crate) pad: [__u8; 3usize],
    pub(crate) pad2: ::core::ffi::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of io_uring"][::core::mem::size_of::<io_uring>() - 216usize];
    ["Alignment of io_uring"][::core::mem::align_of::<io_uring>() - 8usize];
    ["Offset of field: io_uring::sq"][::core::mem::offset_of!(io_uring, sq) - 0usize];
    ["Offset of field: io_uring::cq"][::core::mem::offset_of!(io_uring, cq) - 104usize];
    ["Offset of field: io_uring::flags"][::core::mem::offset_of!(io_uring, flags) - 192usize];
    ["Offset of field: io_uring::ring_fd"][::core::mem::offset_of!(io_uring, ring_fd) - 196usize];
    ["Offset of field: io_uring::features"][::core::mem::offset_of!(io_uring, features) - 200usize];
    ["Offset of field: io_uring::enter_ring_fd"]
        [::core::mem::offset_of!(io_uring, enter_ring_fd) - 204usize];
    ["Offset of field: io_uring::int_flags"]
        [::core::mem::offset_of!(io_uring, int_flags) - 208usize];
    ["Offset of field: io_uring::pad"][::core::mem::offset_of!(io_uring, pad) - 209usize];
    ["Offset of field: io_uring::pad2"][::core::mem::offset_of!(io_uring, pad2) - 212usize];
};
unsafe extern "C" {
    pub(crate) fn __liburing_queue_init(
        entries: ::core::ffi::c_uint,
        ring: *mut io_uring,
        flags: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub(crate) fn __liburing_submit(ring: *mut io_uring) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub(crate) fn __liburing_submit_and_wait(
        ring: *mut io_uring,
        wait_nr: ::core::ffi::c_uint,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub(crate) fn __liburing_wait_cqe(
        ring: *mut io_uring,
        cqe_ptr: *mut *mut io_uring_cqe,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub(crate) fn __liburing_wait_cqe_timeout(
        ring: *mut io_uring,
        cqe_ptr: *mut *mut io_uring_cqe,
        ts: *mut __kernel_timespec,
    ) -> ::core::ffi::c_int;
}
unsafe extern "C" {
    pub(crate) fn __liburing_cqe_seen(ring: *mut io_uring, cqe: *mut io_uring_cqe);
}
unsafe extern "C" {
    pub(crate) fn __liburing_queue_exit(ring: *mut io_uring);
}
unsafe extern "C" {
    pub(crate) fn __liburing_get_sqe(ring: *mut io_uring) -> *mut io_uring_sqe;
}
unsafe extern "C" {
    pub(crate) fn __liburing_prep_socket(
        sqe: *mut io_uring_sqe,
        domain: ::core::ffi::c_int,
        type_: ::core::ffi::c_int,
        protocol: ::core::ffi::c_int,
        flags: ::core::ffi::c_uint,
    );
}
unsafe extern "C" {
    pub(crate) fn __liburing_prep_connect(
        sqe: *mut io_uring_sqe,
        fd: ::core::ffi::c_int,
        addr: *const sockaddr,
        addrlen: socklen_t,
    );
}
unsafe extern "C" {
    pub(crate) fn __liburing_prep_write(
        sqe: *mut io_uring_sqe,
        fd: ::core::ffi::c_int,
        buf: *const ::core::ffi::c_void,
        nbytes: ::core::ffi::c_uint,
        offset: __u64,
    );
}
unsafe extern "C" {
    pub(crate) fn __liburing_prep_read(
        sqe: *mut io_uring_sqe,
        fd: ::core::ffi::c_int,
        buf: *mut ::core::ffi::c_void,
        nbytes: ::core::ffi::c_uint,
        offset: __u64,
    );
}
unsafe extern "C" {
    pub(crate) fn __liburing_prep_close(sqe: *mut io_uring_sqe, fd: ::core::ffi::c_int);
}
unsafe extern "C" {
    pub(crate) fn __liburing_prep_openat(
        sqe: *mut io_uring_sqe,
        dfd: ::core::ffi::c_int,
        path: *const ::core::ffi::c_char,
        flags: ::core::ffi::c_int,
        mode: mode_t,
    );
}
unsafe extern "C" {
    pub(crate) fn __liburing_prep_accept(
        sqe: *mut io_uring_sqe,
        fd: ::core::ffi::c_int,
        addr: *mut sockaddr,
        addrlen: *mut socklen_t,
        flags: ::core::ffi::c_int,
    );
}
